public_html/AR/14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="it" xml:lang="it">
<head>
<!-- 2022-02-22 mar 17:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AR - Lesson 14</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alessandro Straziota" />
<link rel="stylesheet" href="/appunti.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">AR - Lesson 14</h1>
<div id="table-of-contents">
<h2>Indice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5e6a7a2">Sistemi di Voto Posizionali</a>
<ul>
<li><a href="#org4ff21bc">Problema dell ex aequo</a></li>
<li><a href="#org00f7d52">Rilevanza delle Alternative Irrilevanti</a></li>
</ul>
</li>
<li><a href="#org77f7abf">Sistemi di Voto Affidabili</a>
<ul>
<li><a href="#orgd7cc863">Principio di Paretro - Unanimità</a></li>
<li><a href="#org8ea9c4a">Principio d'Indipendenza dalle Alternative Irrilevanti</a></li>
</ul>
</li>
<li><a href="#orgc85b24c">Il Teorema (di Impossibilità) di Arrow</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5e6a7a2" class="outline-2">
<h2 id="org5e6a7a2">Sistemi di Voto Posizionali</h2>
<div class="outline-text-2" id="text-org5e6a7a2">
<p>
Supponiamo che i voti individuali siano espressi sotto forma di <span class="underline">ranking</span> \((r_1, ..., r_k) \in \Pi(\left[ n \right])^k\).
Una classe diversa di sistemi di voto cerca di produrre un ranking di gruppo \(r\) <span class="underline">direttamente</span> dalle classifiche individuali \(r_1, ..., r_k\),
piuttosto che costruire \(r\) da confronti tra coppie di alternative.<br />
</p>

<p>
In un sistema di voto <b>posizionale</b> a ciascun ranking \(r_h\) viene assegnata una <b>funzione peso</b> \(w_h\) la quale associa un valore numerico a ciascuna alternativa
<span class="underline">dipendentemente</span> dalla sua posizione nel ranking \(r_h\).
Tale funzione \(w_h\) per essere sensata è tipicamente decrescente, ovvero se un'alternativa \(a\) sta in una posizione bassa (tra i primi posti) rispetto a \(r_h\) avrà un peso \(w_h(a)\) alto,
viceversa se \(a\) sta verso gli ultimi posti allora \(w_h(a)\) assumerà un valore più basso.<br />
</p>

<p>
Un esempio di funzione peso \(w_h\) per il ranking \(r_h = \langle a_{h1}, ..., a_{hn} \rangle\) è la seguente
\[
  w_h(a_{hi}) = \frac{1}{i} \;\; \forall i \in \left[ n \right]
  \]
</p>

<p>
Una volta associata una funzione peso ad ogni ranking si calcola il <b>peso collettivo</b> di un'alternativa \(a\) semplicemente sommando i pesi dei seingoli rankingk, ovvero
\[
  w(a) = \sum_{h = 1}^{k} w_h(a)
  \]
Infine le alternative vengono quindi ordinate in base al loro peso totale, e in base ad esse definito un ranking collettibo \(r\).
</p>

<p>
Il <b>Borda Count</b> è un particolare sistema di <i>voto posizionale</i> nel quale per ogni votante \(h \in \left[ k \right]\) la funzione di peso associata al ranking \(r_h\) è definita come segue
\[
  \rho_h(a_{hi}) = n - i \;\;\; \forall i \in \left[ n \right]
  \]
</p>
</div>

<div id="outline-container-org4ff21bc" class="outline-3">
<h3 id="org4ff21bc">Problema dell ex aequo</h3>
<div class="outline-text-3" id="text-org4ff21bc">
<p>
Anche nei sistemi posizionali si manigesta il <i>paradosso di Condorcet</i> sotto forma di <b>ex aequo</b> (pareggio).
</p>

<p>
Consideriamo ancora una volta l'esempio dei tre amici che devono andare in campeggio, visto nella <a href="./13.html">lezione precedente</a>.
Le tre classifiche erano
</p>
<ul class="org-ul">
<li><code>A</code>: \(\langle\)🍫, 🍒, 🍯\(\rangle\).</li>
<li><code>B</code>: \(\langle\)🍒, 🍯, 🍫\(\rangle\).</li>
<li><code>C</code>: \(\langle\)🍯, 🍫, 🍒\(\rangle\).</li>
</ul>

<p>
Applichiamo ora il Borda Count, ottendo le seguenti funzioni peso
</p>
\begin{array}{ccc}
  \rho_A(🍫) = 2 & \rho_A(🍒) = 1 & \rho_A(🍯) = 0\\
  \rho_B(🍒) = 2 & \rho_B(🍯) = 1 & \rho_B(🍫) = 0\\
  \rho_C(🍯) = 2 & \rho_C(🍫) = 1 & \rho_C(🍒) = 0
\end{array}

<p>
Alla fine otteremo un pareggio tra i pesi finali
\[
   \rho(🍫) = \rho(🍒) = \rho(🍯) = 3
   \]
Perciò è necessario supporre che se due alternative ricevono lo stesso peso totale, allora viene utilizzato un sistema di <b>spareggio</b> organizzato in anticipo per decidere quale di queste due alternative posizionare di fronte all'altra.
</p>
</div>
</div>

<div id="outline-container-org00f7d52" class="outline-3">
<h3 id="org00f7d52">Rilevanza delle Alternative Irrilevanti</h3>
<div class="outline-text-3" id="text-org00f7d52">
<p>
Consideriamo una rassegna cinematografica, in cui una giuria composta da cinque critici <code>A</code>, <code>B</code>, <code>C</code>, <code>D</code>, <code>E</code> deve eleggere un vincitore tra i film <i>"Via col Vento"</i> (alternativa <code>VV</code>) e <i>"Il Padrino"</i> (alternativa <code>IP</code>).
Tre guidici su 5 ritengono che <code>VV</code> sia il film che debba vincere.
Le classifiche riultano quindi essere
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">
<caption class="t-above"><span class="table-number">Tabella 1:</span> Classifiche dei 5 giudici.</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Giudici</th>
<th scope="col" class="org-left">1° posto</th>
<th scope="col" class="org-left">2° posto</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>A</code></td>
<td class="org-left"><i>Via col Vento</i></td>
<td class="org-left"><i>Il Padrino</i></td>
</tr>

<tr>
<td class="org-left"><code>B</code></td>
<td class="org-left"><i>Il Padrino</i></td>
<td class="org-left"><i>Via col Vento</i></td>
</tr>

<tr>
<td class="org-left"><code>C</code></td>
<td class="org-left"><i>Via col Vento</i></td>
<td class="org-left"><i>Il Padrino</i></td>
</tr>

<tr>
<td class="org-left"><code>D</code></td>
<td class="org-left"><i>Il Padrino</i></td>
<td class="org-left"><i>Via col Vento</i></td>
</tr>

<tr>
<td class="org-left"><code>E</code></td>
<td class="org-left"><i>Via col Vento</i></td>
<td class="org-left"><i>Il Padrino</i></td>
</tr>
</tbody>
</table>

<p>
A questo punto gli organizzatori nella rassegna decidono di introdurre un novo film nella gara, <i>"Pulp Fiction"</i> (alternativa <code>PF</code>).<br />
</p>

<p>
Tutta la giuria è d'accordo che <code>PF</code> non è all'altezza della competizione e che quindi non può vincere.
Tuttavia i player <code>B</code> e <code>D</code> (i due che preferiscono <code>IP</code> a <code>VV</code>) possono creare un ranking in modo tale da far vincere il loro preferito.
Infatti ponendo <code>PF</code> al secondo posto nella loro classifica, e <code>VV</code> all'utlimo, possono compromettere il risultato finale.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">
<caption class="t-above"><span class="table-number">Tabella 2:</span> Nuove classifiche.</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Giudici</th>
<th scope="col" class="org-left">1° posto</th>
<th scope="col" class="org-left">2° posto</th>
<th scope="col" class="org-left">3° posto</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>A</code></td>
<td class="org-left"><i>Via col Vento</i></td>
<td class="org-left"><i>Il Padrino</i></td>
<td class="org-left"><i>Pulp Fiction</i></td>
</tr>

<tr>
<td class="org-left"><code>B</code></td>
<td class="org-left"><i>Il Padrino</i></td>
<td class="org-left"><i>Pulp Fiction</i></td>
<td class="org-left"><i>Via col Vento</i></td>
</tr>

<tr>
<td class="org-left"><code>C</code></td>
<td class="org-left"><i>Via col Vento</i></td>
<td class="org-left"><i>Il Padrino</i></td>
<td class="org-left"><i>Pulp Fiction</i></td>
</tr>

<tr>
<td class="org-left"><code>D</code></td>
<td class="org-left"><i>Il Padrino</i></td>
<td class="org-left"><i>Pulp Fiction</i></td>
<td class="org-left"><i>Via col Vento</i></td>
</tr>

<tr>
<td class="org-left"><code>E</code></td>
<td class="org-left"><i>Via col Vento</i></td>
<td class="org-left"><i>Il Padrino</i></td>
<td class="org-left"><i>Pulp Fiction</i></td>
</tr>
</tbody>
</table>

<p>
Con questa nuova graduatoria avremo i seguenti pesi collettivi
</p>
\begin{align*}
  \rho(\texttt{``Via col Vento''}) &= 6\\
  \rho(\texttt{``Il Padrino''}) &= 7\\
  \rho(\texttt{``Pulp Fiction''}) &= 2
\end{align*}

<p>
In pratica, classificando in maniera opportuna l'<b>alternativa irrilevante</b> (ovvero <code>PF</code>) si riesce a compromettere la graduatoria finale della competizione.
Questo è uno dei problemi principali di cui soffrono i sistemi di voto posizionali.
</p>
</div>
</div>
</div>

<div id="outline-container-org77f7abf" class="outline-2">
<h2 id="org77f7abf">Sistemi di Voto Affidabili</h2>
<div class="outline-text-2" id="text-org77f7abf">
<p>
Fin ora abbiamo incontrato alcune tipologie di sistemi di voto, ognuna affetta da "patologie" (problematiche che lo rendono non del tutto affidabile).
Alcune problematiche incontrate sono state
</p>
<ul class="org-ul">
<li><b>Paradosso di Condorcet</b>: col sistema a maggioranza non risco sempre ad individuare una classifica finale coerente.</li>
<li><b>Strategic Agenda Setting</b>: col sistema a torneo la graduatoria finale dipende dall'ordinamento iniziale delle alterantive.</li>
<li><b>Alternative Irrilevanti</b>: nel sistema posizionale si possono classificare le alternative irrilevanti per condizionare la graduatoria finale.</li>
</ul>

<p>
Ad questo punto ha senso fare un passo indietro dai sistemi di voto specifici e porsi una domanda più generale:
</p>
<blockquote>
<p>
<i>esiste un sistema di voto che produca una classifica collettiva (per tre o più alternative) evitando tutte le "patologie" precedentemente descritte?</i>
</p>
</blockquote>
<p>
o meglio ancora
</p>
<blockquote>
<p>
<i>riusciamo a definire un sistema di voto sempre <b>affidabile</b>?</i>
</p>
</blockquote>

<p>
Per quanto visto in precedenza, un paio di condizioni <span class="underline">minime</span> per avere l'affidabilità di un sistema di voto sono:
</p>
<ul class="org-ul">
<li>il voto finale deve rappresentare le scelte di tutti i votanti qualora tutti siano d'accordo su qualcosa.</li>
<li>non deve essere possibile sfruttare le alternative irrilevanti per modificare la graduatoria finale.</li>
</ul>

<p>
Per quanto riguarda il paradosso di Condorcet, se esprimiamo la graduatoria finale in termini di ranking \(r\) avremo sempre una classifica non ambigua (basta introdurre un metodo imparziale per lo spareggio).<br />
</p>

<p>
Analiziamo ora in maniera più formale le due condizioni minime per ottenere un sistema di voto affidamile.
</p>
</div>

<div id="outline-container-orgd7cc863" class="outline-3">
<h3 id="orgd7cc863">Principio di Paretro - Unanimità</h3>
<div class="outline-text-3" id="text-orgd7cc863">
<p>
Sia \(\sigma\) un <i>sistema di voto</i> con \(n\) alternative e \(k\) votanti.
Siano i ranking \((r_1, ..., r_k) \in \Pi(\left[ n \right])^k\) dei \(k\) partecipanti.
Indichiamo con \(r\) il <span class="underline">voto collettivo</span> ruspetto ai ranking \(r_1, ..., r_k\), tali che
\[
   \sigma(r_1, ..., r_k, r) = \texttt{True}
   \]
In fine, per ogni votante \(h \in \left[ k \right]\) indichiamo la funzione di peso Borda count \(\rho_h\) rispetto a \(r_h\),
e la funzione \(\rho\) rispetto al voto collettivo \(r\).<br />
</p>

<p>
Il principio dell'<b>Unanimità</b> (o <b>Principio di Paretro</b>) vuole che nel caso in cui un'alternativa <code>X</code> è preferita ad un'alternativa <code>Y</code> per <span class="underline">tutti</span> i votanti \(h \in \left[ k \right]\),
allora anche nella graduatoria finale <code>X</code> deve essere preferito a <code>Y</code>.
Più formalmente
\[
   \forall i,j \in \left[ n \right]\\
   \left[
   \forall h \in \left[ k \right] \rho_h(i) > \rho_h(j)
   \implies \rho(i) > \rho(j)
   \right]
   \]
</p>

<p>
D'ora in poi ci riferiremo al principio dell'unanimità con <code>U</code>.
</p>
</div>
</div>

<div id="outline-container-org8ea9c4a" class="outline-3">
<h3 id="org8ea9c4a">Principio d'Indipendenza dalle Alternative Irrilevanti</h3>
<div class="outline-text-3" id="text-org8ea9c4a">
<p>
Sia \(\sigma\) un <i>sistema di voto</i> con \(n\) alternative e \(k\) votanti.<br />
</p>

<p>
Il principio dell'<b>Indipendenza dalle Alternative Irrilevanti</b> si richiede che per ogni coppia di alternative <code>X</code>, <code>Y</code> il loro ordinamento nella graduatoria finale \(r\) dipende
<span class="underline">unicamente</span> dalle posizioni relative rispetto alle graduatorie individuali.
In poche parole, se in una graduatoria finale <code>X</code> è preferita ad <code>Y</code>, anche se introduciamo una nuova alternativa <code>Z</code>, il sistema deve produrre un nuovo ranking in cui <code>X</code> rimane ancora il preferito rispetto a <code>Y</code>.<br />
</p>

<p>
Più formalmente
\[
   \forall i,j \in \left[ n \right]
   \forall (r_1, ..., r_k), (r'_1, ..., r'_k) \in \Pi(\left[ n \right])^k\\
   \left[
   \left( \forall h \in \left[ k \right] \rho_h(i) > \rho_h(j) \iff \rho'_h(i) > \rho'_h(j) \right)\\
   \implies \left( \rho(i) > \rho(j) \iff \rho'(i) > \rho'(j) \right)
   \right]
   \]
dove \(\rho'\) è il Borda count collettivo rispetto al ranking \((r'_1, ..., r'_k)\), in accordo col sistema di voto \(\sigma\).<br />
</p>

<p>
D'ora in poi ci riferiremo al principio dell'indipendenza dalle alternative irrilevanti con <code>IIA</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc85b24c" class="outline-2">
<h2 id="orgc85b24c">Il Teorema (di Impossibilità) di Arrow</h2>
<div class="outline-text-2" id="text-orgc85b24c">
<p>
<b>[DA FINIRE&#x2026;]</b>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Data: 2021-12-06 lun 00:00</p>
<p class="author">Autore: Alessandro Straziota</p>
<p class="email">Email: <a href="mailto:alessandrostr95@gmail.com">alessandrostr95@gmail.com</a></p>
<p class="date">Created: 2022-02-22 mar 17:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
